In [1]:
import pandas as pd
import numpy as np


people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}
df = pd.DataFrame(people)
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [11]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [13]:
df.isna().sum()

first    3
last     3
email    3
age      3
dtype: int64

In [15]:
df.isna().sum()  / len(df)  ##percentage

first    0.428571
last     0.428571
email    0.428571
age      0.428571
dtype: float64

In [2]:
# df.dropna(axis='columns',how='all',inplace=True)   ##default args : axis='index',how= 'any'  ##drops None and NaN values
# df

In [3]:
# df = pd.DataFrame(people)   
# df.dropna(axis='index',how='any',inplace=True)  ##if there is any none value in a row remove that row
# df

In [4]:
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [5]:
df.dropna(axis='index',how='any')

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [6]:
df.dropna()   ##drop both row and columns if any none value

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [7]:
df.isna()      ##mask our NaN values with True

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [8]:
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [9]:
df.dtypes  ##numbers are currently objects not float

first    object
last     object
email    object
age      object
dtype: object

In [10]:
df['age'].mean()   ##won't work because age column is object not float

TypeError: can only concatenate str (not "int") to str

In [ ]:
type(np.nan)

In [ ]:
df['age'] = df['age'].astype('float')
df['age'].mean()

In [ ]:
df.dtypes

In [ ]:
na_vals = ['NA','Missing']

##instead of df.replace('NA',np.nan,inplace=True) and df.replace('Missing',np.nan,inplace=True)
df = pd.read_csv('csv_data/survey_results_public.csv',index_col='Respondent',na_values=na_vals)     
schema_df= pd.read_csv('csv_data/survey_results_schema.csv',index_col='Column')

pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [ ]:
df['YearsCode']

In [ ]:
df['YearsCode'].unique()

In [ ]:
df['YearsCode'] = df['YearsCode'].astype('float')   ##does not work because we have strings currently
df['YearsCode'].mean()

In [ ]:
df['YearsCode'].replace({'Less than 1 year':0,'More than 50 years':51},inplace=True)
df['YearsCode'] = df['YearsCode'].astype('float')
print('mean value: ',df['YearsCode'].mean())
print('median value: ',df['YearsCode'].median())